src/mp_toir/Documents/мп_НарядНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_НарядНаРемонт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыНарядаНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.мп_ЗаданиеНаРемонт</v8:Type>
								<v8:Type>cfg:DocumentRef.РегистрацияДефекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнители</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДДокументаРабота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокументаРабота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнениеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/мп_НарядНаРемонт/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УникальныеИсполнители = ОбщегоНазначения.ВыгрузитьКолонку(Исполнители, "Ответственный", Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗРаботы", Работы);
	Запрос.Текст = ТекстЗапросаИсполнителиЗаданияНаРемонт();

	Результат = Запрос.Выполнить();
	КВыгрузке = Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавилиИсполнителей = Ложь;
		ДокЗадание = Выборка.ЗаданиеНаРемонт.ПолучитьОбъект();
		Для Каждого ТекСтрока Из УникальныеИсполнители Цикл
			ИсполнительДокумента = ДокЗадание.Исполнители.Найти(ТекСтрока, "Ответственный");
			Если ИсполнительДокумента = Неопределено Тогда
				ДобавилиИсполнителей = Истина;
				НоваяСтрока = ДокЗадание.Исполнители.Добавить();
				НоваяСтрока.Ответственный = ТекСтрока;
			КонецЕсли;
		КонецЦикла;
		Если ДобавилиИсполнителей Тогда
			ДокЗадание.СтатусОбмена = КВыгрузке;
			ДокЗадание.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтотОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкевКИС Тогда
		УзелЦентральнойБазы = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
		ПланыОбмена.ЗарегистрироватьИзменения(УзелЦентральнойБазы, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для Каждого ТекСтрока Из Работы Цикл
		ТекСтрока.УИДДокументаРабота = Строка(ТекСтрока.Работа.УникальныйИдентификатор());
		ТекСтрока.ВидДокументаРабота = ТекСтрока.Работа.Метаданные().Имя;
	КонецЦикла;
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаИсполнителиЗаданияНаРемонт()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТЗРаботы.Работа КАК Работа
	|ПОМЕСТИТЬ вт_Работы
	|ИЗ
	|	&ТЗРаботы КАК ТЗРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мп_ЗаданиеНаРемонт.Ссылка КАК ЗаданиеНаРемонт
	|ИЗ
	|	Документ.мп_ЗаданиеНаРемонт КАК мп_ЗаданиеНаРемонт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Работы КАК вт_Работы
	|		ПО ((ВЫРАЗИТЬ(вт_Работы.Работа КАК Документ.мп_ЗаданиеНаРемонт)) = мп_ЗаданиеНаРемонт.Ссылка)";

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти
#Иначе

	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли
